АПК/Catalogs/Отделы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Отделы</Name>
			<Comment>Отделы компании</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/Catalogs/УчетныеЗаписиTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/Catalogs/Отделы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтарыйРуководительОтдела = Объект.РуководительОтдела;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РуководительСменен = СтарыйРуководительОтдела <> ТекущийОбъект.РуководительОтдела
	И ЗначениеЗаполнено(ТекущийОбъект.РуководительОтдела);
	
	ПараметрыЗаписи.Вставить("РуководительСменён", РуководительСменен);
	
	СтарыйРуководительОтдела = ТекущийОбъект.РуководительОтдела;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи["РуководительСменён"] Тогда 
		Возврат;
	КонецЕсли;
	
	ОтправитьУведомленияСотрудникамОтдела(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаФормы

&НаСервере
Процедура ОтправитьУведомленияСотрудникамОтдела(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	УчетныеЗаписиTelegram.Сотрудник.Отдел = &Отдел
	|	И УчетныеЗаписиTelegram.ID <> """"
	|	И НЕ УчетныеЗаписиTelegram.Сотрудник.ПометкаУдаления";
	Запрос.УстановитьПараметр("Отдел", ТекущийОбъект.РуководительОтдела.Отдел);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Текст = "Здравствуйте! " + Символы.ПС
		+ "В вашем отделе " + """" + Строка(Объект.Наименование) 
		+ """" + " произошла смена руководства." + Символы.ПС 
		+ "Ваш новый руководитель: " + Строка(Объект.РуководительОтдела);
		
		МодульTelegram.SendMessage(Выборка.ID, Текст);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
